#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xy          1     NONE   float   xy  
; TEXCOORD                 1   xyzw        2     NONE   float   xy w
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 3442f8ad03ef125d4ab6e4df76d3918e.pdb
; shader hash: 3442f8ad03ef125d4ab6e4df76d3918e
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
; TEXCOORD                 1                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; Resource bind info for cBuffer
; {
;
;   struct hostlayout.struct._ConstantBuffer
;   {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !31)
!1 = !DIFile(filename: "..\5C..\5C..\5C..\5C..\5C..\5C..\5C..\5C..\5CCatTuber64\5CShader\5CCode\5CPixelMaskedPremult.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "PixelMaskedPremult", scope: !1, file: !1, line: 44, type: !5, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @PixelMaskedPremult)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !19}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !9, templateParams: !15)
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!15 = !{!16, !17}
!16 = !DITemplateTypeParameter(name: "element", type: !11)
!17 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 4)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "VS_OUT", file: !1, line: 36, size: 320, align: 32, elements: !20)
!20 = !{!21, !22, !30}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !19, file: !1, line: 37, baseType: !7, size: 128, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !19, file: !1, line: 38, baseType: !23, size: 64, align: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !25, templateParams: !28)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !{!16, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 2)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "clipPosition", scope: !19, file: !1, line: 39, baseType: !7, size: 128, align: 32, offset: 192)
!31 = !{!32, !66, !70, !72, !73}
!32 = !DIGlobalVariable(name: "cBuffer", linkageName: "\01?cBuffer@@3V?$StructuredBuffer@U_ConstantBuffer@@@@A", scope: !0, file: !1, line: 23, type: !33, isLocal: false, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<_ConstantBuffer>", file: !1, line: 23, size: 1536, align: 32, elements: !2, templateParams: !34)
!34 = !{!35}
!35 = !DITemplateTypeParameter(name: "element", type: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ConstantBuffer", file: !1, line: 14, size: 1536, align: 32, elements: !37)
!37 = !{!38, !61, !62, !63, !64, !65}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "projectMatrix", scope: !36, file: !1, line: 16, baseType: !39, size: 512, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 23, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 23, size: 512, align: 32, elements: !41, templateParams: !58)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !40, file: !1, line: 23, baseType: !11, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!58 = !{!16, !59, !60}
!59 = !DITemplateValueParameter(name: "row_count", type: !18, value: i32 4)
!60 = !DITemplateValueParameter(name: "col_count", type: !18, value: i32 4)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "clipMatrix", scope: !36, file: !1, line: 17, baseType: !39, size: 512, align: 32, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "baseColor", scope: !36, file: !1, line: 18, baseType: !7, size: 128, align: 32, offset: 1024)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "multiplyColor", scope: !36, file: !1, line: 19, baseType: !7, size: 128, align: 32, offset: 1152)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "screenColor", scope: !36, file: !1, line: 20, baseType: !7, size: 128, align: 32, offset: 1280)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "channelFlag", scope: !36, file: !1, line: 21, baseType: !7, size: 128, align: 32, offset: 1408)
!66 = !DIGlobalVariable(name: "mainTexture", linkageName: "\01?mainTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 27, type: !67, isLocal: false, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 27, size: 160, align: 32, elements: !2, templateParams: !68)
!68 = !{!69}
!69 = !DITemplateTypeParameter(name: "element", type: !8)
!70 = !DIGlobalVariable(name: "mainSampler", linkageName: "\01?mainSampler@@3USamplerState@@A", scope: !0, file: !1, line: 28, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!72 = !DIGlobalVariable(name: "maskTexture", linkageName: "\01?maskTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 29, type: !67, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "maskSampler", linkageName: "\01?maskSampler@@3USamplerState@@A", scope: !0, file: !1, line: 33, type: !71, isLocal: false, isDefinition: true)
!74 = !{i32 2, !"Dwarf Version", i32 4}
!75 = !{i32 2, !"Debug Info Version", i32 3}
!76 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
