#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; TEXCOORD                 0   xy          0     NONE   float   xy  
; TEXCOORD                 1   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; TEXCOORD                 1   xyzw        2     NONE   float   xyzw
;
; shader debug name: 263917bafc95090238de47f34c82a868.pdb
; shader hash: 263917bafc95090238de47f34c82a868
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; TEXCOORD                 0                              
; TEXCOORD                 1                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
; TEXCOORD                 1                 linear       
;
; Buffer Definitions:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !36)
!1 = !DIFile(filename: "..\5C..\5C..\5C..\5C..\5C..\5C..\5C..\5C..\5CCatTuber64\5CShader\5CCode\5CVertSetupMask.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "VertSetupMask", scope: !1, file: !1, line: 41, type: !18, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @VertSetupMask)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VS_OUT", file: !1, line: 33, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 34, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !1, line: 35, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "clipPosition", scope: !20, file: !1, line: 36, baseType: !4, size: 128, align: 32, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VS_IN", file: !1, line: 27, size: 128, align: 32, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !32, file: !1, line: 28, baseType: !24, size: 64, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !32, file: !1, line: 29, baseType: !24, size: 64, align: 32, offset: 64)
!36 = !{!37}
!37 = !DIGlobalVariable(name: "cBuffer", linkageName: "\01?cBuffer@@3V?$StructuredBuffer@U_ConstantBuffer@@@@A", scope: !0, file: !1, line: 23, type: !38, isLocal: false, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<_ConstantBuffer>", file: !1, line: 23, size: 1536, align: 32, elements: !2, templateParams: !39)
!39 = !{!40}
!40 = !DITemplateTypeParameter(name: "element", type: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ConstantBuffer", file: !1, line: 14, size: 1536, align: 32, elements: !42)
!42 = !{!43, !66, !67, !68, !69, !70}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "projectMatrix", scope: !41, file: !1, line: 16, baseType: !44, size: 512, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 23, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 23, size: 512, align: 32, elements: !46, templateParams: !63)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !45, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!63 = !{!13, !64, !65}
!64 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!65 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "clipMatrix", scope: !41, file: !1, line: 17, baseType: !44, size: 512, align: 32, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "baseColor", scope: !41, file: !1, line: 18, baseType: !4, size: 128, align: 32, offset: 1024)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "multiplyColor", scope: !41, file: !1, line: 19, baseType: !4, size: 128, align: 32, offset: 1152)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "screenColor", scope: !41, file: !1, line: 20, baseType: !4, size: 128, align: 32, offset: 1280)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "channelFlag", scope: !41, file: !1, line: 21, baseType: !4, size: 128, align: 32, offset: 1408)
!71 = !{i32 2, !"Dwarf Version", i32 4}
!72 = !{i32 2, !"Debug Info Version", i32 3}
!73 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
!74 = !{!"..\5C..\5C..\5C..\5C..\5C..\5C..\5C..\5C..\5CCatTuber64\5CShader\5CCode\5CVertSetupMask.hlsl", !"//cbuffer CBuffer : register(b0, space3)\0D\0A//{\0D\0A//    float4x4 projectMatrix;\0D\0A//    float4x4 clipMatrix;\0D\0A//    float4 baseColor;\0D\0A//    float4 multiplyColor;\0D\0A//    float4 screenColor;\0D\0A//    float4 channelFlag; \0D\0A//}\0D\0A\0D\0A//\E8\BF\99\E9\87\8C\E7\9A\84\E7\BB\98\E5\88\B6\E5\8F\82\E6\95\B0\E6\98\AF\E6\AF\8F\E4\B8\AA\E5\9B\BE\E5\B1\82\E6\8C\81\E6\9C\89\E7\9A\84\E5\AF\B9\E8\B1\A1\E5\8F\82\E6\95\B0\EF\BC\8C\E4\B8\8D\E6\98\AF\E5\85\A8\E5\B1\80\E5\8F\82\E6\95\B0\EF\BC\8C\E5\86\8D\E5\8A\A0\E4\B8\8ASDL\E5\AF\B9Uniform\E7\9A\84\E5\AE\B9\E9\87\8F\E9\99\90\E5\88\B6\EF\BC\88\E8\B6\85\E8\BF\8732768\E5\AD\97\E8\8A\82\E5\90\8E\E4\BC\9A\E9\87\8D\E7\BD\AE\E7\BC\93\E5\AD\98\E5\AF\BC\E8\87\B4\E6\95\B0\E6\8D\AE\E8\AE\BF\E9\97\AE\E5\87\BA\E9\97\AE\E9\A2\98\EF\BC\89\0D\0A//\E5\9B\A0\E6\AD\A4\E9\9C\80\E8\A6\81\E6\8D\A2\E4\B8\80\E4\B8\AA\E7\BC\93\E5\AD\98\E5\BD\A2\E5\BC\8F\0D\0A\0D\0Astruct _ConstantBuffer\0D\0A{\0D\0A    float4x4 projectMatrix;\0D\0A    float4x4 clipMatrix;\0D\0A    float4 baseColor;\0D\0A    float4 multiplyColor;\0D\0A    float4 screenColor;\0D\0A    float4 channelFlag;\0D\0A};\0D\0AStructuredBuffer<_ConstantBuffer> cBuffer : register(t0, space0);\0D\0A\0D\0A\0D\0A// Vertex shader input\0D\0Astruct VS_IN {\0D\0A    float2 pos : TEXCOORD0;\0D\0A    float2 uv : TEXCOORD1;\0D\0A};\0D\0A\0D\0A// Vertex shader output\0D\0Astruct VS_OUT {\0D\0A    float4 Position : SV_POSITION;\0D\0A    float2 uv : TEXCOORD0;\0D\0A    float4 clipPosition : TEXCOORD1;\0D\0A};\0D\0A\0D\0A\0D\0A// Mask shader\0D\0AVS_OUT VertSetupMask(VS_IN In) {\0D\0A    \0D\0A    \0D\0A    VS_OUT Out = (VS_OUT)0;\0D\0A    Out.Position = mul(float4(In.pos, 0.0f, 1.0f), cBuffer[0].projectMatrix);\0D\0A    Out.clipPosition = mul(float4(In.pos, 0.0f, 1.0f), cBuffer[0].projectMatrix);\0D\0A    Out.uv.x = In.uv.x;\0D\0A    Out.uv.y = 1.0f - +In.uv.y;\0D\0A    return Out;\0D\0A}\0D\0A//VS_OUT VertSetupMask(VS_IN In) {\0D\0A//    VS_OUT Out = (VS_OUT)0;\0D\0A//    Out.Position = mul(float4(In.pos, 0.0f, 1.0f), projectMatrix);\0D\0A//    Out.clipPosition = mul(float4(In.pos, 0.0f, 1.0f), projectMatrix);\0D\0A//    Out.uv.x = In.uv.x;\0D\0A//    Out.uv.y = 1.0f - +In.uv.y;\0D\0A//    return Out;\0D\0A//}"}
!75 = !{!"..\5C..\5C..\5C..\5C..\5C..\5C..\5C..\5C..\5CCatTuber64\5CShader\5CCode\5CVertSetupMask.hlsl"}
!76 = !{!"-E", !"VertSetupMask", !"-T", !"vs_6_0", !"/Od", !"/Zi", !"/Qembed_debug"}
!77 = !{i32 1, i32 0}
!78 = !{i32 1, i32 7}
!79 = !{!"vs", i32 6, i32 0}
!80 = !{!81, null, null, null}
!81 = !{!82}
!82 = !{i32 0, %"hostlayout.class.StructuredBuffer<_ConstantBuffer>"* undef, !"cBuffer", i32 0, i32 0, i32 1, i32 12, i32 0, !83}
!83 = !{i32 1, i32 192}
!84 = !{i32 0, %hostlayout.struct._ConstantBuffer undef, !85, %"hostlayout.class.StructuredBuffer<_ConstantBuffer>" undef, !93}
!85 = !{i32 192, !86, !88, !89, !90, !91, !92}
!86 = !{i32 6, !"projectMatrix", i32 2, !87, i32 3, i32 0, i32 7, i32 9}
!87 = !{i32 4, i32 4, i32 2}
!88 = !{i32 6, !"clipMatrix", i32 2, !87, i32 3, i32 64, i32 7, i32 9}
!89 = !{i32 6, !"baseColor", i32 3, i32 128, i32 7, i32 9}
!90 = !{i32 6, !"multiplyColor", i32 3, i32 144, i32 7, i32 9}
!91 = !{i32 6, !"screenColor", i32 3, i32 160, i32 7, i32 9}
!92 = !{i32 6, !"channelFlag", i32 3, i32 176, i32 7, i32 9}
!93 = !{i32 192, !94}
!94 = !{i32 6, !"h", i32 3, i32 0}
!95 = !{i32 1, void ()* @VertSetupMask, !96}
!96 = !{!97}
!97 = !{i32 0, !2, !2}
!98 = !{[8 x i32] [i32 6, i32 12, i32 3855, i32 3855, i32 0, i32 0, i32 16, i32 32]}
!99 = !{void ()* @VertSetupMask, !"VertSetupMask", !100, !80, !112}
!100 = !{!101, !107, null}
!101 = !{!102, !105}
